app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Post #1"], ["text", "Hello"], ["date", "2019-02-12 00:30:00"], ["created_at", "2019-02-11 22:30:36.053894"], ["updated_at", "2019-02-11 22:30:36.053894"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "89215320-purple-glitter-lights-background-defocused.jpg"], ["updated_at", "2019-02-13 11:06:05.313625"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)